---
kind: method
id: M:Autodesk.Revit.DB.RuledSurface.GetFirstProfileCurve
source: html/fd892c31-0118-ddef-7396-2e9fc4b0cf27.htm
---
# Autodesk.Revit.DB.RuledSurface.GetFirstProfileCurve Method

Returns a copy of the first profile curve if it is set.

## Syntax (C#)
```csharp
public Curve GetFirstProfileCurve()
```

## Returns
A copy of the first profile curve, if it exists. If a point was used to define the first profile, this function will return Nothing nullptr a null reference ( Nothing in Visual Basic) .